{"text": "Catalytic pyrolysis of polypropylene over hierarchical ZSM-5 catalysts in a continuous fixed-bed reactor. Polypropylene waste was thermally decomposed at 450–600 °C under nitrogen, followed by vapor upgrading through mesoporous ZSM-5 prepared via a dual-template approach. The influence of mesoporosity and Brønsted acidity on intermediate cracking pathways was studied using in situ DRIFTS. GC–MS analysis showed a significant enhancement in the BTX fraction (up to 48 wt%) at 550 °C with reduced heavy wax formation. Coke deposition profiles were measured through TGA, showing lower deactivation rates for hierarchical catalysts compared to conventional microporous ZSM-5. These results demonstrate that pore-engineered catalysts substantially improve mass transport and hydrocarbon selectivity during plastic pyrolysis.", "label": "exp"}

{"text": "Microwave-assisted debromination and pyrolysis of HIPS-Br using Ca-based composite sorbents. Brominated polystyrene waste was blended with CaO and Ca(OH)2 powders and exposed to microwave heating at 700–900 W. The rapid uniform heating promoted debromination and lowered activation energy for styrene recovery. GC–MS analysis revealed a styrene monomer yield of 62 wt%, while ion chromatography of off-gases confirmed >95% HBr capture efficiency. XRD identified CaBr2 as the dominant solid-phase product. Thermogravimetric analysis demonstrated suppressed char formation, indicating improved volatilization pathways. The combination of Ca-based sorbents and microwave heating provides an environmentally friendly route for processing flame-retardant plastics.", "label": "exp"}

{"text": "Hydrothermal conversion of PET bottle waste in subcritical water at 240–280 °C. Post-consumer PET flakes were treated in a batch reactor to study depolymerization kinetics under various NaOH concentrations. Reaction monitoring through HPLC revealed rapid scission of ester bonds, producing terephthalic acid and ethylene glycol with yields exceeding 85 wt% at 260 °C. FTIR confirmed full removal of carbonyl peaks associated with PET backbone. Solid residues were analyzed by SEM showing morphological collapse correlated with temperature increase. These findings highlight subcritical water as a promising green processing route for PET recycling.", "label": "exp"}

{"text": "Catalytic cracking of mixed PE/PP plastics over spent FCC catalyst in a fluidized-bed reactor. Waste polyolefins were processed at 500–550 °C under continuous operation. Hydrocarbon vapors were upgraded using equilibrium catalyst recovered from refinery FCC units. Product analysis via micro-GC revealed high selectivity toward C5–C12 alkanes and alkenes, with total liquid yields of 72 wt%. SEM–EDS of spent catalyst showed coke deposition primarily on zeolite domains. Process stability was maintained for 8 h TOS, indicating suitability for industrial-scale polyolefin recycling.", "label": "exp"}

{"text": "Low-temperature oxidative cracking of polypropylene at 80–120 °C for selective formation of oxygenated chemicals. Polypropylene powder was subjected to controlled oxidative conditions in a sealed stainless-steel vessel. Reaction intermediates were tracked through GC–MS and NMR, indicating tandem radical and oxidative scission steps. The process yielded up to 38 wt% terminal ketones and alcohols within 15 minutes at 100 °C. TGA showed suppressed char formation, and FTIR analysis confirmed incorporation of C=O functional groups. This study proposes a low-energy pathway for PP upcycling into functional molecules.", "label": "exp"}

{"text": "Unravelling intermediate species during catalytic pyrolysis of polypropylene using confocal fluorescence microscopy, UV–Vis spectroscopy, and NMR. PP films were pyrolyzed at 450–550 °C over fresh and spent FCC catalysts. Fluorescence mapping revealed evolution of polyaromatic intermediates, correlating with GC–MS trends. Coke deposition was quantified through Raman spectroscopy, showing distinct graphitization stages. These results provide mechanistic insight into catalytic pathways governing PP cracking.", "label": "exp"}

{"text": "Hydrothermal treatment of PVC-derived hydrochar to evaluate chlorine migration during plastic waste conversion. PVC powders were treated in water at 200–240 °C, followed by heating to 500 °C for secondary pyrolysis. Ion chromatography showed >80% chlorine removal during hydrothermal pretreatment. Solid products were analyzed by XRD and XPS confirming formation of inorganic chloride phases. These results highlight hydrothermal pretreatment as an effective chlorine mitigation route for PVC pyrolysis.", "label": "exp"}

{"text": "Catalytic conversion of polyethylene into aromatics using Pt/ZSM-5. PE pellets were converted in a two-stage reactor system combining thermal cracking at 520 °C and catalytic aromatization at 480 °C. GC–MS showed BTX yields exceeding 50 wt%, while TEM of spent catalysts indicated metal sintering suppression due to confinement within ZSM-5 channels. This approach demonstrates effective aromatization of polyolefin waste.", "label": "exp"}

{"text": "Transforming PVC plastic waste into benzene via hydrothermal treatment in a multi-phase system. PVC flakes were processed at 250–280 °C in a water–oil biphasic medium with Fe-based catalysts. GC–MS revealed selective formation of benzene and chlorinated aromatics, while chloride ions migrated into the aqueous phase. ICP–OES confirmed metal stability across multiple cycles. This study highlights hydrothermal catalysis for converting PVC into valuable chemicals.", "label": "exp"}

{"text": "Upcycling plastic waste into CNTs via pyrolysis–chemical vapor deposition. Mixed polyolefin waste and face masks were pyrolyzed at 700 °C to produce hydrocarbon vapors, which served as carbon feed for Ni-based catalysts during CVD growth at 800 °C. TEM confirmed formation of multi-walled CNTs with controlled diameter distribution. Raman spectroscopy indicated high graphitization degree. This combined pyrolysis–CVD route demonstrates plastic-to-nanomaterial conversion.", "label": "exp"}



{"text": "DFT-driven mechanistic insight into polyethylene dehydrogenation pathways over Pt–Sn catalysts. Using periodic DFT with dispersion corrections, the adsorption energies of various PE-derived radicals were computed to map β-scission energetics. Transition-state optimization revealed the role of alloying in stabilizing dehydrogenation intermediates. These results provide theoretical guidance but do not involve experimental thermal cracking studies.", "label": "noexp"}

{"text": "Synthesis of TiO2 nanoparticles via sol–gel processing for photocatalytic degradation of dyes. Titanium isopropoxide was hydrolyzed under controlled pH, followed by calcination. The work focuses on nanoparticle formation, morphology, and photocatalytic performance, without involving polymer pyrolysis or thermal decomposition of plastics.", "label": "noexp"}

{"text": "Graphene-based nanofiber electrodes for lithium-ion batteries fabricated via electrospinning and carbonization. Polyacrylonitrile fibers were stabilized at 250 °C and carbonized at 800 °C under nitrogen. Electrochemical evaluation demonstrated improved cycling, but the study does not examine plastic pyrolysis pathways.", "label": "noexp"}

{"text": "A machine learning framework for predicting graphene quality synthesized by flash Joule heating. Model inputs included precursor composition and current density. No experiments related to polymer pyrolysis, thermal degradation of plastics, or catalytic cracking were performed.", "label": "noexp"}

{"text": "Hydrothermal carbonization of cellulose to produce functional carbon materials for supercapacitors. Reaction parameters such as pH and temperature influenced char morphology. Although thermal processing is involved, the system contains no synthetic polymers or plastic pyrolysis.", "label": "noexp"}

{"text": "Green hydrolysis pathways for PET depolymerization using ionic liquid catalysts. Reaction kinetics and solvent optimization were evaluated, but the method relies on chemical solvolysis rather than pyrolysis or thermal cracking. The work focuses on PET recycling chemistry rather than pyrolysis experiments.", "label": "noexp"}

{"text": "Photocatalytic reforming of PET under visible-light irradiation using carbon nitride microtubes. The process generates hydrogen and small molecules under mild conditions without applying pyrolysis temperatures or thermal cracking setups.", "label": "noexp"}

{"text": "Synthesis of mesoporous ZrO2/carbon composites using sol–gel and template removal methods for oxidative dehydrogenation of ethylbenzene. Although high-temperature calcination is involved, no polymer pyrolysis or plastic degradation reactions are tested.", "label": "noexp"}

{"text": "Electrochemical oxidation of lignin-derived molecules on Co-doped carbon electrodes for generating aromatic chemicals. The study involves biomass conversion and electrochemical catalysis rather than plastic pyrolysis experimentation.", "label": "noexp"}

{"text": "Comprehensive review of thermochemical recycling technologies including pyrolysis, gasification, and hydrothermal liquefaction. The paper summarizes literature trends without presenting new experimental data or conducting actual pyrolysis reactions of plastics.", "label": "noexp"}

